In [1]:
import numpy as np
import pandas as pd

In [13]:
# Create 4 Python data objects
labels = ['a','b','c']  # List of objects with string elements
my_data = [10,20,30]  # list of objects with integer elements
arr = np.array(my_data) # numpy array of the list
d = {'a' : 10, 'b' : 20, 'c' : 30} # dictionary

In [3]:
 # Create a pandas series object with a Python list
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
type(pd.Series(my_data))

pandas.core.series.Series

In [7]:
my_data

[10, 20, 30]

In [8]:
labels

['a', 'b', 'c']

In [9]:
# Add our own labels to the pandas series
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [14]:
# Create a Pandas series object with a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [15]:
# Create a pandas series object with a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
d

{'a': 10, 'b': 20, 'c': 30}

In [17]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [18]:
pd.Series(labels,labels)

a    a
b    b
c    c
dtype: object

In [21]:
# Creating the following pandas series
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [25]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [26]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [27]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [28]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [29]:
ser1 - ser2

Germany    0.0
Italy      NaN
Japan      0.0
USA        0.0
USSR       NaN
dtype: float64

In [30]:
ser1/ser2

Germany    1.0
Italy      NaN
Japan      1.0
USA        1.0
USSR       NaN
dtype: float64

In [31]:
ser1*ser2

Germany     4.0
Italy       NaN
Japan      16.0
USA         1.0
USSR        NaN
dtype: float64

In [32]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [33]:
np.exp(ser1)

USA         2.718282
Germany     7.389056
USSR       20.085537
Japan      54.598150
dtype: float64

In [34]:
ser1 > 2

USA        False
Germany    False
USSR        True
Japan       True
dtype: bool

In [35]:
# Fix the seed of the random generator
np.random.seed(101)

In [36]:
# Create a 5x4 numpy array
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [40]:
# Create a pnada dataframe from a numpy array
# Note the dimensions
# The first set of labels is for the rows
# The second set of labels is for the columns
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

df

In [41]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [42]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [43]:
df['Y']

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [44]:
df['X']

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [45]:
# To obtain one column, enter name of colum
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [46]:
# The output of this will be a pandas series
type(df['W'])

pandas.core.series.Series

In [47]:
# To obtain two or more colums, enter colum names as a list
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [48]:
df[['Y','Z']]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752
E  0.238127  1.996652

In [49]:
df[['W','X','Z']]

          W         X         Z
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752
E -0.116773  1.901755  1.996652

In [50]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [51]:
df['new'] = df['W'] + df['Y']

In [52]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [53]:
df['new1'] = df['W']/df['Z']

In [54]:
df

          W         X         Y         Z       new      new1
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420 -0.261117
B -0.134841  0.390528  0.166905  0.184502  0.032064 -0.730837
C  0.807706  0.072960  0.638787  0.329646  1.446493  2.450220
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510 -1.025482
E -0.116773  1.901755  0.238127  1.996652  0.121354 -0.058485

In [55]:
# Can also apply the numpy functions
df['new2'] = np.exp(df['W'])

In [56]:
df

          W         X         Y         Z       new      new1      new2
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420 -0.261117  1.353462
B -0.134841  0.390528  0.166905  0.184502  0.032064 -0.730837  0.873855
C  0.807706  0.072960  0.638787  0.329646  1.446493  2.450220  2.242757
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510 -1.025482  0.608290
E -0.116773  1.901755  0.238127  1.996652  0.121354 -0.058485  0.889787

In [57]:
df.drop('new',axis=1)

          W         X         Y         Z      new1      new2
A  0.302665  1.693723 -1.706086 -1.159119 -0.261117  1.353462
B -0.134841  0.390528  0.166905  0.184502 -0.730837  0.873855
C  0.807706  0.072960  0.638787  0.329646  2.450220  2.242757
D -0.497104 -0.754070 -0.943406  0.484752 -1.025482  0.608290
E -0.116773  1.901755  0.238127  1.996652 -0.058485  0.889787

In [58]:
df

          W         X         Y         Z       new      new1      new2
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420 -0.261117  1.353462
B -0.134841  0.390528  0.166905  0.184502  0.032064 -0.730837  0.873855
C  0.807706  0.072960  0.638787  0.329646  1.446493  2.450220  2.242757
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510 -1.025482  0.608290
E -0.116773  1.901755  0.238127  1.996652  0.121354 -0.058485  0.889787

In [60]:
df.drop('new',axis=1,inplace=True)

In [61]:
df

          W         X         Y         Z      new1      new2
A  0.302665  1.693723 -1.706086 -1.159119 -0.261117  1.353462
B -0.134841  0.390528  0.166905  0.184502 -0.730837  0.873855
C  0.807706  0.072960  0.638787  0.329646  2.450220  2.242757
D -0.497104 -0.754070 -0.943406  0.484752 -1.025482  0.608290
E -0.116773  1.901755  0.238127  1.996652 -0.058485  0.889787

In [66]:
df.drop('new1',axis=1, inplace=True)

In [67]:
df

          W         X         Y         Z      new2
A  0.302665  1.693723 -1.706086 -1.159119  1.353462
B -0.134841  0.390528  0.166905  0.184502  0.873855
C  0.807706  0.072960  0.638787  0.329646  2.242757
D -0.497104 -0.754070 -0.943406  0.484752  0.608290
E -0.116773  1.901755  0.238127  1.996652  0.889787

In [68]:
df.drop('new2',axis=1, inplace=True)

In [69]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [70]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

# How to extract info from dataframe

In [71]:
# Get a column
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [72]:
# Get two or more columns
# Column names as list
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [73]:
# Get a row 
# Note : output as a series (colum format)
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [74]:
# Another way to get a row
# Enter the raw number
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [75]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [76]:
# Golden rule: if you enter a row name, must use '.loc'
df.loc['C','Z']

0.32964629880452445

In [77]:
# Obtain a column as a series 
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [78]:
# To output the column as a dataframe
# Use an extra set of brackets
df[['W']]

          W
A  0.302665
B -0.134841
C  0.807706
D -0.497104
E -0.116773

In [79]:
df['W']['A']

0.3026654485851825

In [84]:
df[['W']].loc['A','W']

0.3026654485851825

In [85]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [86]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [87]:
df.loc['C']

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [88]:
df.loc[['C']]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646